Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/B08A.tmx
Source language: en_us
Languages: zh_cn

source: All the Queen's strength is built on Philip's enduring love
zh_cn: 伊丽莎白和菲利普：妇唱夫随 相濡以沫

source: Look back over the centuries at Britain's greatest constitutional monarchs and a common theme soon emerges: their reign was also a love story. It is what separates George III, Victoria, George V and George VI from the rest.
zh_cn: 回顾数百年英国最伟大的立宪君主，很容易发现他们有一个共同点：他们在位时也有爱情故事，如乔治三世（George III），维多利亚（Victoria），乔治五世（George V）和乔治六世（George VI）。

source: And it has never been more true than in the case of our present Queen who, a few weeks from now, will become only the second monarch in our history to mark 60 years on the throne.
zh_cn: 我们现在的女王就是其中最典型的例子，数星期后，她将成为我国历史上第二位在位60年的君主。

source: Just as the phrase 'Victoria and Albert' has entered the language and tripped off the tongue for years, so, I believe, future generations will talk of 'Elizabeth and Philip'.
zh_cn: 正如 “维多利亚和阿尔伯特（Victoria and Albert）”多年来已成为人们口头禅，所以，我相信，将来 “伊丽莎白和菲利普（Elizabeth and Philip）” 的故事也将被世世代代传下去。

source: Prince Philip, with the Queen, was taken to hospital as a precautionary measure, according to Buckingham Palace Ask any good friend of the Royal Family for the secret of the Queen's enduring resilience and you will usually get the same response: 'Good health, a strong faith and Prince Philip.'
zh_cn: 据白金汉宫称，作为预防措施，菲利普亲王（Prince Philip）和女王去医院检查。 询问王室的一些好朋友，女王持久乐观的秘密，你通常会得到相同的回答：“良好的健康，坚强的信念，还有菲利普亲王的陪伴。

source: That is why there has been such concern and, latterly, such relief in the past three days.
zh_cn: ”这是为什么，在过去三天里，他们如此相亲相爱、相濡以沫的原因。

source: More...Royal Family attend Christmas Day service at Sandringham as Duke of Edinburgh recovers in hospital from heart operation Queen says Royal Wedding was 'a personal reminder of the value of loved ones' as the world goes through 'difficult times' in poignant Christmas Day message This reign has been a team effort from the very start. And the Duke of Edinburgh's heart scare, as the Royal Family gathered for Christmas at Sandringham, was not just a threat to a much-loved paterfamilias but to the whole team as well.
zh_cn: 女王从即位始，两人就已在相互扶携。 当王室成员聚集在桑德林汉姆（Sandringham）过圣诞时，爱丁堡公爵的心脏引发了恐慌，不但威胁到深受人们喜爱的一家之长的生命，也让女王备受煎熬。

source: Like any couple who have celebrated a diamond wedding anniversary, the Queen and the Duke have been through the peaks and troughs of family life.
zh_cn: 像一些夫妇一样，他们也举办钻石婚纪念活动，女王夫妇经历过家庭生活的高峰和低谷。

source: But in their case, those moments have been enjoyed or endured in the public gaze --- and for more than 60 years.
zh_cn: 60多年以来，他们享受生活或面临考验的时刻，公众都历历在目。

source: And when we look back on the Queen's reign, we can see moments which we might now take for granted but which, at the time, could have unhinged a lesser mortal.
zh_cn: 回顾女王在位期间，我们看到的那些重要时刻，现在可能认为理所当然的事，在当时并非我们所想，可能会让普通人精神错乱。

source: Double act: The Duke and the Queen wave farewell to Australia at Perth International Airport One can point, for example, to any number of personal setbacks during that dire five-year spell between the 'annus horribilis' of 1992 and the death of Diana, Princess of Wales in 1997.
zh_cn: 妇唱夫随：在澳大利亚珀斯国际机场，公爵和女王向人们挥手告别。 有一件事可以证明这种观点，例如1992年，女王称之为多灾之年（温莎古堡失火、查尔斯王子、安德鲁王子和安妮公主的婚姻纷纷破裂）至1997年威尔士王妃戴安娜死亡，这可怕的五年时间里，她要面对好些个人挫折。

source: These were moments of great personal stress yet the Queen sailed through them all, holding her composure and her nerve, not least because there was always her 'liege man of life and limb' to whom she could turn.
zh_cn: 这位伟大的女性面对这些重要时刻带来的压力，保持着沉着和勇敢，轻松的渡过了这些危机。 尤其是女王生活的伴侣，也是左膀右臂的菲利普公爵，总是帮助她渡过危机。

source: Whenever events might have conspired against her, there was the other member of the team at her side.
zh_cn: 无论何时，何事可能对她不利，她的旁边总有他的身影。

source: To this day, for all her experience, you will still see the Queen cast an eye across a chaotic walkabout just to check that the Duke is at hand. He, in turn, will be working his way through the crowd, bringing the smallest children across to the Queen and checking that her armfuls of flowers are being efficiently conveyed to the royal convoy.
zh_cn: 至今，尽管她有经验，你将仍能看到女王的目光透过混乱的巡游队伍来确认公爵是否就在附近，反过来，公爵践行着他的职责，他穿过人群，带小孩到女王面前，查看女王抱的花是否顺利地递到了皇家护卫的手中。

source: One of the reasons that the Queen enjoyed her recent tour of Australia so much was that the Duke was on cracking form. His mood can lift any atmosphere.
zh_cn: 女王最近喜欢访问澳大利亚的众多原因之一，因为公爵健康状况不佳，他的心情可能会因此次旅行变得好转起来。

source: The Queen is not one of life's attention-seekers.
zh_cn: 女王不属于那些喜欢在生活中寻求关注的人。

source: While her late mother was a natural performer, the Monarch is, by nature, more reserved --- like her late father.
zh_cn: 她已故的母亲是个天生的表演家，而女王像她的先父，生性保守。

source: In another existence, she would never have sought the spotlight which fell on her at birth and which has intensified with time.
zh_cn: 另一种方面，自始至终，女王从未愿意寻求成为众人瞩目的焦点，随着时间的推移，这种愿望越来越强烈。

source: Yet this shy, cautious person has had to take centre stage at countless historic world events --- leading the country in prayer and remembrance, serving as the focal point for national emotions at any given time.
zh_cn: 这位害羞的，谨慎的女士，在无数历史性的世界事件中站在事件的中心――在一些特定的时间，作为国家情感的代表，带领国家祈祷和纪念。

source: It has been a very tall order, but she has accomplished it with such style and dignity that she is not only the most famous but, arguably, the most respected woman on the planet.
zh_cn: 这曾是非常难以完成的任务，她不只是一位最出名的女士，她以她的风范和尊严完成了任务，可以说，她是这世上最受人尊重的女性。

source: And there is little doubt what underpins that inner confidence, that stoical devotion to duty.
zh_cn: 但是有一点疑问，什么使她如此自信、坚忍、忠于职守？

source: Team: Prince Philip and the Queen leave Buckingham Palace in an open carriage to attend the ceremony of Trooping the Colour in 2004.
zh_cn: 女王夫妇：菲利普亲王和女王乘坐一辆敞蓬四轮马车离开白金汉宫，参加2004年的皇家军队阅兵仪式。

source: In the course of researching my new portrait of the Monarch, Our Queen, I spoke to many friends of the couple.
zh_cn: 我在研究我们女王新画像的过程中，与女王夫妇的很多朋友交谈过。

source: As one put it: 'There are some people who don't need many friends.
zh_cn: 有人说：“有一些人不需要很多的朋友。

source: And those two, they're just a real love story --- taking tea together every day, talking about everything.
zh_cn: 这两位，简直是真正的爱情故事，他们一起喝茶，无话不谈。

source: He might take out a letter and read it to her, or crack a joke.
zh_cn: 他可能取出一封信读给她听，或说个笑话。

source: They just adore each other.'
zh_cn: 他们彼此爱慕。

source: This weekend's visits to Papworth Hospital were not simply to cheer up the Duke.
zh_cn: ” 女王本周末访问帕普沃思医院，不只是让公爵高兴。

source: A famously bad patient who hates the idea of being a nuisance, he is not one for bedside visitors.
zh_cn: 这位著名的病人，讨厌生病这样的麻烦事和他不是一位看望病人的探访者。

source: Indeed, the last time he was in hospital for any length of time --- in 2008 --- the only people he wanted to see were members of staff bearing correspondence, speeches, research papers and so on.
zh_cn: 实际上，他上次呆在医院是2008年，那次呆了较长一段日子，他唯一想看的人是给他带来信件，演讲稿，研究论文等的工作人员。

source: No, these Christmas visits have been as much about lifting the Queen's spirits as about bolstering the patient.
zh_cn: 这些圣诞探望，不只是鼓励公爵，也鼓舞了女王。

source: This is always a time of year which emphasises the importance of families but, for the Royal Family, Christmas is also a time which emphasises the importance of the Duke.
zh_cn: 这是一年中彰显家庭重要性的日子，但对王室成员来说，圣诞节也是彰显公爵重要价值的日子。

source: Soon after she succeeded to the Throne, the Queen put the Duke in charge of the royal estates at Sandringham and Balmoral.
zh_cn: 在她继承王位不久后，女王安排公爵为桑德林汉姆和巴尔莫勒尔皇家不动产总管。

source: They are private spaces where he can exercise his formidable intellect and his love of ideas without any of the constitutional restrictions which apply at Buckingham Palace.
zh_cn: 在那里，他们的私人空间，不受白金汉姆宫中任何宪法的约束，可以自由施展他的聪明才智和兴趣爱好。

source: Everything from the new wood-chip boilers which have been powering the royal central heating this Christmas to the accelerated composter which recycles all the leftovers in the Sandringham visitors' restaurant have been the Duke's projects.
zh_cn: 从圣诞节期间为皇家中央暖气系统（royal central heating）提供能源的新木材锅炉，到回收桑德灵汉姆的宾客吃剩的餐厅食物的加速堆肥器（accelerated composter），每样都是由公爵所设计。

source: No one has a greater knowledge of the way the place works.
zh_cn: 没人在房屋的运作上用这多的心思。

source: He will know exactly which game birds are up or down in which part of the estate.
zh_cn: 他准确地知道哪只猎鸟更有价值。

source: He will be more delighted than anyone when Sandringham's experimental truffle farm finally produces its first truffle.
zh_cn: 当桑德灵汉姆的实验松露农场终于生长出第一棵松露，没人比他更高兴。

source: It was the Duke who installed some of Britain's very first solar panels on a Sandringham farmhouse back in the Seventies.
zh_cn: 七十年代，公爵把英国的一些第一代太阳能电池板安装在桑德灵汉姆的农舍上。

source: His imprint is stamped all over those 20,000 acres. And it has made his absence even more pronounced.
zh_cn: 两万英亩的农场到处都是他的足迹，这样，他不在的时候，别人就更容易注意到了。

source: 'Everyone has had a nasty scare,' says one official. 'This has been such a successful year that many people have been saying: "Aren't they amazing; aren't they invincible?" Well, now we have had a sudden reminder that they are also very precious and we need to take care of them.'
zh_cn: “每个人都感到忐忑不安”，一位官员说，“这一年本显得一帆风顺，因为很多人都一直在说，他们不再让人觉得了不起;不再让人觉得不可战胜，好了，现在我们突然意识到，他们也非常可爱，我们需要照顾他们”。

source: Focused: The Queen and the Duke listening to a speech by King Constantine of the Hellenes at Wellington College, Crowthorne, Berkshire this year Certainly, it is unlikely that the Queen is going to allow the Duke to put together a schedule like the one he had arranged for himself a few weeks ago.
zh_cn: 聚精会神：今年伯克郡，克罗索那的惠灵顿学院，女王和公爵在听希腊国王康斯坦丁（Constantine）的演讲。 当然，女王不太可能允许公爵像几个星期前那样，把自已的时间表安排得紧紧的。

source: Having returned from that Australian tour late on a Saturday night, he had been due to fly to Italy the following Monday morning, by easyJet, for a conference involving one of the many global organisations he himself has founded.
zh_cn: 他们从澳大利亚旅游回到英国，已是星期六的晚上，公爵已定好周一上午要乘坐易捷航空飞往意大利，去参加他自己创办的其中一家全球公司的会议。

source: However, the visit was cancelled because he had developed a cold.
zh_cn: 但是，访问被取消，因为他得了感冒。

source: Nonetheless, a day later he was helping the Queen host a major dinner.
zh_cn: 尽管如此，一天后，他协助女王主持一场晚宴。

source: The next evening, he attended a Trinity House dinner in his honour and, the following morning, he was receiving a delegation from the British Sub-Aqua Club before an engagement at Westminster Abbey.
zh_cn: 第二天晚上，他出席了领港公会（Trinity House）授勋晚宴，并于翌日早上，在赴威斯敏斯特教堂（Westminster Abbey）约会前，接待了英国潜水协会代表团（British Sub-Aqua Club）。

source: By the next week, the schedule was back to normal --- receptions for his Duke of Edinburgh Award scheme and the Diplomatic Corps, a day-trip to Margate and so on.
zh_cn: 接下来的一星期，日程安排又恢复了正常，接待他的爱丁堡公爵奖计划成员和外交使节团，参加马尔盖特一天游等等。

source: We have seen the Queen and the Duke perform such duties for so long that we regard such stamina as entirely normal (they themselves would probably see it that way, too).
zh_cn: 我们已看到女王和公爵履行职责很长时间，因为我们认为这样的精力非常正常（他们可能也这样认为）。

source: But it is, of course, not remotely normal for a nonagenarian.
zh_cn: 但实际上，九旬老人已近期颐。

source: And next year's Diamond Jubilee celebrations, which begin in a matter of weeks, will place considerable extra demands on the couple.
zh_cn: 而明年钻石婚庆祝活动，几个星期后开始，将对这对夫妇提出相当高的要求。

source: Earlier this month, it was announced that they would tour every region of the UK between March and the end of July (when the Queen will open the Olympics) but that they would leave the international celebrations to the younger members of the family.
zh_cn: 本月早些时候，王室宣布，女王夫妇将从三月至七月底（那时女王将宣布奥运会开幕）到英国每一个地区旅行，但他们将不会参加国际庆祝活动，他们会与王室的年轻成员呆在一起。

source: The wisdom of that decision is beyond doubt.
zh_cn: 这个决定毋庸置疑是明智的。

source: The schedule is still a daunting one, with many nights spent aboard the Royal Train and walkabouts planned from Cornwall to the Highlands.
zh_cn: 日程安排仍然让人望而生畏，多少个夜晚乘坐皇家列车，从康沃尔郡高地到苏格兰高地的徒步旅行计划。

source: The central weekend, with its Thames pageant, pop concert and carriage procession across London will be every bit as momentous as the Olympics.
zh_cn: 周末主要的活动：泰晤士河盛会、流行音乐会及穿越伦敦的马车游行。 这些活动都和奥运会一样重要。

source: That the Queen and her staff can approach it all so calmly and confidently is down to the assumption that all will be well with the Duke at her side.
zh_cn: 有公爵常伴左右，女王与工作人员才能游刃有余、信心十足地处理好一切。

source: Elizabeth and Philip are a pair whose world view was shaped by war and whose wedding, in 1947, was governed by austerity.
zh_cn: 1947年，时逢二战刚结束，伊丽莎白和菲利普的婚礼吸引了全世界的目光，他们的婚礼办得很节俭。

source: They have embraced change and new ideas with more enthusiasm than any of their predecessors.
zh_cn: 和他们的一些前任相比，他们积极地接受变化和新思想。

source: Yet they still retain the natural reticence and modesty of their generation.
zh_cn: 但他们仍保持固有的沉默和他们那一代人的谦虚。

source: Their love for one another, while blindingly obvious, is seldom discussed in public.
zh_cn: 他们彼此相爱，当明显不理解什么事物时，也很少在公开场合讨论。

source: But, very occasionally, we are given a glimpse of the depth of those feelings.
zh_cn: 很偶然的，我们窥到了这些感情的深度。

source: Having just endured the most trying five years of her reign ЎЄ and just two months after the funeral of Diana, Princess of Wales ЎЄ the Queen made a speech to mark her Golden Wedding anniversary in November 1997.
zh_cn: 1997年11月，女王刚刚经历在位最艰难的五年，在威尔士王妃戴安娜的葬礼短短两个月后，女王发表演讲，纪念她的金婚纪念日。

source: Her words on that occasion could just as well be uttered today: 'All too often, I fear, Prince Philip has had to listen to me speaking.
zh_cn: 她那时说的话，正好用在今天：“很多时候，我担心，菲利普亲王对我演讲的看法。

source: Frequently we have discussed my intended speech beforehand and, as you will imagine, his views have been expressed in a forthright manner.
zh_cn: 我们经常在演讲前相互讨论，正如你猜想的，他一向说话直言不讳。

source: 'He is someone who doesn't take easily to compliments but he has, quite simply, been my strength and stay all these years, and I, and his whole family, and this and many other countries, owe him a debt greater than he would ever claim, or we shall ever know.'
zh_cn: 他是那种不轻易恭维的人，但他很坦率，这些年，他是我、家庭、英国和其他许多国家的力量和支柱，欠他的恩情，超过我们给他的，或我们永远无法知道。”
